/*
 * =====================================================================================
 *
 *       Filename:  292.c
 *
 *    Description:  292. Nim Game
 * 分析: 
 * 1. 如果有1，2，3个，则必赢
 * 2. 如果有4个，则必输
 * 3. 如果有5个，则必赢
 * 4. 如有有6个，则必赢
 * 5. 如果有7个，则必赢
 * 6. 如果有8个，则必输
 * 以此推理
 *
 * =====================================================================================
 */
#include <stdlib.h>

class Solution {
public:
    bool canWinNim(int n) {
        if (n % 4 == 0)
            return false;
        else
            return true;
    }
};
